Welcome to the little Python developer test
===================================

Below you will find few exercises to work on. For each exercise there is a cell to write your code in. Occasionally some code sniplet is provided to start with. Once you have filled a cell, you can run your code in the cells (Shft + Enter). If your code needs a variable which has been assigned in another cell above or it needs some package which is imported in another cell, then please make sure the pre-requisite cell has been run before the cell at hand. 

You can use any sources to solve the questions and the target time for the test is around 30 minutes. When you are done, please save the notebook as .ipynb (File -> Download as) and send it to icoinic.development@gmail.com. If you had any question, contact me. Good coding!

Exercise 1
---------------
You will be provided with a pandas dataframe which contains the population and area of some American states. Please calculate the density of the states in a new column called 'density'.

In [148]:
import pandas as pd
area = pd.Series({'California': 423967, 'Texas': 695662,
                  'New York': 141297, 'Florida': 170312,
                  'Illinois': 149995})
pop = pd.Series({'California': 38332521, 'Texas': 26448193,
                 'New York': 19651127, 'Florida': 19552860,
                 'Illinois': 12882135})
data = pd.DataFrame({'area':area, 'pop':pop})
data

              area       pop
California  423967  38332521
Texas       695662  26448193
New York    141297  19651127
Florida     170312  19552860
Illinois    149995  12882135

In [267]:
data = pd.DataFrame({'area':area, 'pop':pop, 'den': (pop/area)})

Exercise 2
--------------
Select the 'area' column from the dataframe and assign it as a dataframe with the name 'state_area'.

In [164]:
state_area = data[['area']]
state_area

              area
California  423967
Texas       695662
New York    141297
Florida     170312
Illinois    149995

Exercise 3
--------------
Select the rows of those states in 'data' where the density is higher than 100. Assign it to 'crowded' dataframe.

In [165]:
crowded = data.where(data['den'] > 100)
crowded.dropna(inplace = True)
crowded

              area         pop         den
New York  141297.0  19651127.0  139.076746
Florida   170312.0  19552860.0  114.806121

Exercise 4
--------------
Create a column in 'data' which has True value if the state name is longer than 7 characters otherwise False. Calculate the average density for the two groups of states.

In [270]:
def strlen(str):
    if len(str) > 7:
        return True
    else:
        return False

data = pd.DataFrame({'area':area, 'pop':pop, 'den': (pop/area), 'charlim': ""})
data = data.reset_index()

data['charlim'] = data.loc[:, 'index'].apply(lambda x: strlen(x))
avg_density = data.groupby(['charlim'])['den'].mean()
avg_density

charlim
False     76.412430
True     105.124812
Name: den, dtype: float64

Exercise 5
--------
You will have two dataframes which contains the name of employees, their groups and their salaries. Merge the two dataframes such that in each row we can see the group and the salary of an employee next to each other. Do not keep columns which have the same values. Call the new dataframe 'employee'.

In [158]:
employee_group = pd.DataFrame({'employee': ['Bob', 'Jake', 'Lisa', 'Sue'],
                    'group': ['Accounting', 'Engineering', 'Engineering', 'HR']})
name_salary = pd.DataFrame({'name': ['Bob', 'Jake', 'Lisa', 'Sue'],
                    'salary': [70000, 80000, 120000, 90000]})
display(employee_group)
display(name_salary)

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR

   name  salary
0   Bob   70000
1  Jake   80000
2  Lisa  120000
3   Sue   90000

In [274]:
employee = employee_group.merge(name_salary, left_on='employee', right_on='name', how='outer')
employee = employee.drop(['name'], axis=1)
employee

#Solution, whats the main difference (Except its cleaner/shorter)

  employee        group  salary
0      Bob   Accounting   70000
1     Jake  Engineering   80000
2     Lisa  Engineering  120000
3      Sue           HR   90000

In [275]:
employee_group.set_index('employee')
name_salary.set_index('name')

employee = pd.merge(employee_group, name_salary, how='outer', left_index = True, right_index = True)
employee = employee.drop(columns=['name'])

#You probably want to see a cleaner solution by not merging the name column

employee

  employee        group  salary
0      Bob   Accounting   70000
1     Jake  Engineering   80000
2     Lisa  Engineering  120000
3      Sue           HR   90000

Exercise 6
--------
Use groupby command on 'employee' such that the resulted dataframe shows the maximum salary in each 'group'.

In [282]:
employee_view = employee.groupby(['group']).max()
employee_view

            employee  salary
group
Accounting       Bob   70000
Engineering     Lisa  120000
HR               Sue   90000

Exercise 7
---------
Make a statistics from the Titanic survival data. Use pivot_table command to calculate survival ratio within groups where the dimensions are: gender and the travel class (labeled as 'sex' and 'class' in the data)

In [101]:
import numpy as np
import seaborn as sns
titanic = sns.load_dataset('titanic')

In [284]:
titanic.pivot_table('survived', index='sex', columns='class')

class      First    Second  Third
sex
female  0.959459  0.888889    0.6
male    0.421687  0.666667    0.4

In [122]:
tit_piv = pd.pivot_table(titanic, values='survived', index=['class'], columns=['sex'])
tit_piv

#I'm pretty sure that the 'survived' values are wrong, should there be a calculation in front?

sex       female      male
class
First   0.959459  0.421687
Second  0.888889  0.666667
Third   0.600000  0.400000